app/Http/Controllers/Index/IndexpageController.php

select * from `tbl_menu` where `active` = '1' and `tbl_menu`.`parent_id` in (1, 3, 4, 6, 8, 9, 14, 16, 18, 22, 23, 24, 25) order by `ordering` asc
select * from `poll` where `status` = '1' order by `id` desc limit 1
select * from `poll_answer` where `poll_id` = 52
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `url`, `photopath`, `phototitle`, `category_name`, `category_hname` from `article` where (`category_id` = 3 and `web_exclusive` = 0) order by `publish_date` desc, `publish_time` desc limit 4
---
    public function __construct()
    {
        if (Cache::has('menus')) {
            $menus= Cache::get('menus');
        }else{
            $menus = Menu::with('children')->where([['parent_id','0'],['active','1']])->orderby('ordering','asc')->get();
            Cache::put('menus', $menus, 1440);
        };
        if (Cache::has('breaking')) {
            $breaking= Cache::get('breaking');
        }else{
            $breaking = Breaking::where('status','Active')->orderby('news_id','desc')->first();
            Cache::put('breaking', $breaking, 1440);
        };
         if (Cache::has('polls')) {
            $polls= Cache::get('polls');
            $poll_answer= Cache::get('poll_answer');
        }else{
            $polls=  DB::table('poll')->where('status', '1')->orderBy('id', 'desc')->first();
            if(isset($polls)){
            $poll_answer = DB::table('poll_answer')->where('poll_id', $polls->id)->get();
        }else{
            $poll_answer = '';
        }
            Cache::put('polls', $polls, 1440);
            Cache::put('poll_answer', $poll_answer, 1440);
        };
        if (Cache::has('industry-briefing')) {
            $industryBriefing= Cache::get('industry-briefing');
        }else{
            $industryBriefing = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','url','photopath','phototitle','category_name','category_hname')->where([['category_id',3],['web_exclusive',0]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name`, `category_hname` from `article` where (`category_id` = 13 and `web_exclusive` = 0) order by `publish_date` desc, `publish_time` desc limit 10
---
        if (Cache::has('social-media')) {
            $socialM= Cache::get('social-media');
        }else{
            $socialM = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name','category_hname')->where([['category_id',13],['web_exclusive',0]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(10)->get();

select `title`, `url`, `photopath`, `phototitle`, `category_ename`, `category_hname`, `sequence` from `article_feature` where `sequence` != 0 order by `sequence` asc limit 5
---
        if (Cache::has('rightsidemostRead')) {
            $rightsidemostRead= Cache::get('rightsidemostRead');
        }else{
            $rightsidemostRead = DB::table('article_feature')->select('title','url','photopath','phototitle','category_ename','category_hname','sequence')->where('sequence','!=', 0)->orderby('sequence','asc')->limit(5)->get();

select distinct CONCAT(article.publish_date,article.publish_time) AS pickdate,article.article_id,article.title,article.url,article.publish_date,article.photopath,article.phototitle,article.category_hname,article.category_name,article.summary from `article_most_read` inner join `article` on `article_most_read`.`article_id` = `article`.`article_id` where `article_most_read`.`article_id` != 0 and `article`.`publish_date` >= '2019-09-12' order by `article_most_read`.`number_hits` desc limit 6
---
        if (Cache::has('most-read')) {
            $mostRead= Cache::get('most-read');
        }else{
            $mostRead = Mostread::Join('article','article_most_read.article_id','=','article.article_id')->select(DB::raw('CONCAT(article.publish_date,article.publish_time) AS pickdate,article.article_id,article.title,article.url,article.publish_date,article.photopath,article.phototitle,article.category_hname,article.category_name,article.summary'))
            ->where('article_most_read.article_id','!=',0)
            ->where('article.publish_date','>=',$lastsevenday)
            ->orderBy('article_most_read.number_hits','desc')
            ->take(6)->distinct()->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name`, `category_hname` from `article` where (`category_id` = 11 and `web_exclusive` = 0) order by `publish_date` desc, `publish_time` desc limit 3
---
        if (Cache::has('vicharmanch')) {
            $vicharmanch= Cache::get('vicharmanch');
        }else{
            $vicharmanch = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name','category_hname')->where([['category_id',11],['web_exclusive',0]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(3)->get();

select album.id as albumId,album.title as album_title,album.description as album_desc,p.title as photo_title,p.description as photo_desc,p.photopath,p.photo_id from `album` inner join `photos` as `p` on `album`.`id` = `p`.`owner_id` where (`album`.`valid` = 1 and `p`.`owned_by` = 'album' and `p`.`active` = 1) group by `album`.`id` order by `p`.`photo_id` desc limit 10
---
        if (Cache::has('frontalbum')) {
            $frontalbum= Cache::get('frontalbum');
        }else{
            $frontalbum = Album::Join('photos as p', 'album.id', '=', 'p.owner_id')
                          ->select(DB::raw('album.id as albumId,album.title as album_title,album.description as album_desc,p.title as photo_title,p.description as photo_desc,p.photopath,p.photo_id'))->where([['album.valid',1],['p.owned_by','album'],['p.active',1]])->orderBy('p.photo_id', 'desc')->groupby('album.id')->take(10)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where `category_id` = 64 order by `publish_date` desc, `publish_time` desc limit 6
---
        if (Cache::has('techworld')) {
            $tech= Cache::get('techworld');
        }else{
            $tech = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where('category_id',64)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(6)->get();

select `title`, `url`, `photopath`, `phototitle`, `category_ename`, `category_hname`, `sequence` from `article_feature` where `sequence` != 0 order by `sequence` asc limit 5
select `title`, `url`, `photopath`, `phototitle`, `category_ename`, `category_hname`, `sequence` from `custom_section` where `sequence` != 0 order by `sequence` asc limit 5
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `url`, `category_name` from `article` where (`category_id` = 4 and `web_exclusive` = 0) order by `publish_date` desc, `publish_time` desc limit 6
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where (`category_id` = 7 and `web_exclusive` = 0) order by `publish_date` desc, `publish_time` desc limit 6
---
    public function index(Request $request)
    {

        if (Cache::has('homeSlide')) {
            $homeSlide= Cache::get('homeSlide');
        }else{
        	$homeSlide = DB::table('article_feature')->select('title','url','photopath','phototitle','category_ename','category_hname','sequence')->where('sequence','!=', 0)->orderby('sequence','asc')->limit(5)->get();
        	Cache::put('homeSlide', $homeSlide, 1440);
        };

        if (Cache::has('customSection')) {
            $customSection= Cache::get('customSection');
        }else{
            $customSection = DB::table('custom_section')->select('title','url','photopath','phototitle','category_ename','category_hname','sequence')->where('sequence','!=', 0)->orderby('sequence','asc')->limit(5)->get();
            Cache::put('customSection', $customSection, 1440);
        };

        if (Cache::has('media-forum')) {
            $mediaForum= Cache::get('media-forum');
        }else{
            $mediaForum = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','url','category_name')->where([['category_id',4],['web_exclusive',0]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(6)->get();
            Cache::put('media-forum', $mediaForum, 1440);
        };

        if (Cache::has('admission-jobs')) {
            $jobs= Cache::get('admission-jobs');
        }else{
            $jobs = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where([['category_id',7],['web_exclusive',0]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(6)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name`, `category_hname` from `article` where (`category_id` = 5 and `web_exclusive` = 0) order by `publish_date` desc, `publish_time` desc limit 2
---
        if (Cache::has('interviews')) {
            $interview= Cache::get('interviews');
        }else{
            $interview = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name','category_hname')->where([['category_id',5],['web_exclusive',0]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(2)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where (`category_id` = 66 and `web_exclusive` = 0) order by `publish_date` desc, `publish_time` desc limit 4
---
        if (Cache::has('brand-speaks')) {
            $brandSpeaks= Cache::get('brand-speaks');
        }else{
            $brandSpeaks = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where([['category_id',66],['web_exclusive',0]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where (`category_id` = 8 and `web_exclusive` = 0) order by `publish_date` desc, `publish_time` desc limit 4
---
        if (Cache::has('advertisement')) {
            $Adv= Cache::get('advertisement');
        }else{
            $Adv = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where([['category_id',8],['web_exclusive',0]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where (`category_id` = 10 and `web_exclusive` = 0) order by `publish_date` desc, `publish_time` desc limit 10
---
        if (Cache::has('telescope')) {
            $telS= Cache::get('telescope');
        }else{
            $telS = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where([['category_id',10],['web_exclusive',0]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(10)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where (`category_id` = 72) order by `publish_date` desc, `publish_time` desc limit 4
---
        if (Cache::has('poetry')) {
            $poetry= Cache::get('poetry');
        }else{
            $poetry = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where([['category_id',72]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name`, `category_hname` from `article` where (`category_id` = 75) order by `publish_date` desc, `publish_time` desc limit 4
---
        if (Cache::has('print')) {
            $print= Cache::get('print');
        }else{
            $print = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name','category_hname')->where([['category_id',75]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name`, `category_hname` from `article` where (`category_id` = 76) order by `publish_date` desc, `publish_time` desc limit 4
---
        if (Cache::has('tv')) {
            $tv= Cache::get('tv');
        }else{
            $tv = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name','category_hname')->where([['category_id',76]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name`, `category_hname` from `article` where (`category_id` = 77) order by `publish_date` desc, `publish_time` desc limit 4
---
        if (Cache::has('digital')) {
            $digital= Cache::get('digital');
        }else{
            $digital = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name','category_hname')->where([['category_id',77]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name`, `category_hname` from `article` where (`category_id` = 78) order by `publish_date` desc, `publish_time` desc limit 4
---
        if (Cache::has('radio')) {
            $radio= Cache::get('radio');
        }else{
            $radio = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name','category_hname')->where([['category_id',78]])->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `authorname`, `author_id`, `photopath`, `phototitle`, `category_name` from `article` where `category_name` = 'tv-media' order by `publish_date` desc, `publish_time` desc limit 15 offset 0
select count(*) as aggregate from `article` where `category_name` = 'tv-media'
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle` from `article` where `category_id` = 9 order by `publish_date` desc, `publish_time` desc limit 5
select * from `category` where (`e_name` = 'tv-media' and `valid` = 1) limit 1
---
    public function section(Request $request,$section)
    {

        $sectionArticles = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','authorname','author_id','photopath','phototitle','category_name')->where('category_name',$section)->orderby('publish_date','desc')->orderby('publish_time','desc')->paginate(15);

        if (Cache::has('sectionmostRead')) {
            $sectionmostRead= Cache::get('sectionmostRead');
        }else{
            $sectionmostRead = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle')->where('category_id',9)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(5)->get();
            Cache::put('sectionmostRead', $sectionmostRead, 1440);
        };
        $useragent = isset($_SERVER['HTTP_USER_AGENT'])
        ? strtolower($_SERVER['HTTP_USER_AGENT'])
        : '';
        if(preg_match('/(ipad)/i',$useragent)||preg_match('/(android|bb\d+|meego).+mobile|avantgo|bada\/|blackberry|blazer|compal|elaine|fennec|hiptop|iemobile|ip(hone|od)|iris|kindle|lge |maemo|midp|mmp|mobile.+firefox|netfront|opera m(ob|in)i|palm( os)?|phone|p(ixi|re)\/|plucker|pocket|psp|series(4|6)0|symbian|treo|up\.(browser|link)|vodafone|wap|windows ce|xda|xiino/i',$useragent)||preg_match('/1207|6310|6590|3gso|4thp|50[1-6]i|770s|802s|a wa|abac|ac(er|oo|s\-)|ai(ko|rn)|al(av|ca|co)|amoi|an(ex|ny|yw)|aptu|ar(ch|go)|as(te|us)|attw|au(di|\-m|r |s )|avan|be(ck|ll|nq)|bi(lb|rd)|bl(ac|az)|br(e|v)w|bumb|bw\-(n|u)|c55\/|capi|ccwa|cdm\-|cell|chtm|cldc|cmd\-|co(mp|nd)|craw|da(it|ll|ng)|dbte|dc\-s|devi|dica|dmob|do(c|p)o|ds(12|\-d)|el(49|ai)|em(l2|ul)|er(ic|k0)|esl8|ez([4-7]0|os|wa|ze)|fetc|fly(\-|_)|g1 u|g560|gene|gf\-5|g\-mo|go(\.w|od)|gr(ad|un)|haie|hcit|hd\-(m|p|t)|hei\-|hi(pt|ta)|hp( i|ip)|hs\-c|ht(c(\-| |_|a|g|p|s|t)|tp)|hu(aw|tc)|i\-(20|go|ma)|i230|iac( |\-|\/)|ibro|idea|ig01|ikom|im1k|inno|ipaq|iris|ja(t|v)a|jbro|jemu|jigs|kddi|keji|kgt( |\/)|klon|kpt |kwc\-|kyo(c|k)|le(no|xi)|lg( g|\/(k|l|u)|50|54|\-[a-w])|libw|lynx|m1\-w|m3ga|m50\/|ma(te|ui|xo)|mc(01|21|ca)|m\-cr|me(rc|ri)|mi(o8|oa|ts)|mmef|mo(01|02|bi|de|do|t(\-| |o|v)|zz)|mt(50|p1|v )|mwbp|mywa|n10[0-2]|n20[2-3]|n30(0|2)|n50(0|2|5)|n7(0(0|1)|10)|ne((c|m)\-|on|tf|wf|wg|wt)|nok(6|i)|nzph|o2im|op(ti|wv)|oran|owg1|p800|pan(a|d|t)|pdxg|pg(13|\-([1-8]|c))|phil|pire|pl(ay|uc)|pn\-2|po(ck|rt|se)|prox|psio|pt\-g|qa\-a|qc(07|12|21|32|60|\-[2-7]|i\-)|qtek|r380|r600|raks|rim9|ro(ve|zo)|s55\/|sa(ge|ma|mm|ms|ny|va)|sc(01|h\-|oo|p\-)|sdk\/|se(c(\-|0|1)|47|mc|nd|ri)|sgh\-|shar|sie(\-|m)|sk\-0|sl(45|id)|sm(al|ar|b3|it|t5)|so(ft|ny)|sp(01|h\-|v\-|v )|sy(01|mb)|t2(18|50)|t6(00|10|18)|ta(gt|lk)|tcl\-|tdg\-|tel(i|m)|tim\-|t\-mo|to(pl|sh)|ts(70|m\-|m3|m5)|tx\-9|up(\.b|g1|si)|utst|v400|v750|veri|vi(rg|te)|vk(40|5[0-3]|\-v)|vm40|voda|vulc|vx(52|53|60|61|70|80|81|83|85|98)|w3c(\-| )|webc|whit|wi(g |nc|nw)|wmlb|wonu|x700|yas\-|your|zeto|zte\-/i',substr($useragent,0,4))){
        $parents = DB::select( DB::raw("SELECT * FROM banner where mobile=1 AND forpage='section' order by bid asc"));  }else{
        $parents = DB::select( DB::raw("SELECT * FROM banner where desktop=1 AND forpage='section' order by bid asc"));
        }
        $page = explode('/', $request->path());
        $no = end($page);
        $meta = Category::where([['e_name',$section],['valid',1]])->first();

select * from `article` inner join `authors` as `au` on `au`.`author_id` = `article`.`author_id` where `article_id` = '39374'
select * from `article` inner join `authors` as `au` on `au`.`author_id` = `article`.`author_id` where (`category_name` = 'vicharmanch' and `article_id` != '39374' and `category_name` is not null) order by `article_id` desc, `publish_date` desc, `publish_time` desc limit 10
---
    public function story(Request $request,$section,$title,$id)
    {
        $section = str_replace('-news',' ', $section);

                if (Cache::has('articles-'.$id)) {
                $articles= Cache::get('articles-'.$id);
                }else{
                $articles = Article::join('authors as au','au.author_id','=','article.author_id')->where('article_id',$id)->get();
                Cache::put('articles-'.$id, $articles, 1440);
                };

                if( count( $articles ) == 0)
                {
                return view('errors.404');
                }

                if (Cache::has('articlesrelate-'.$id)) {
                $articlesrelate= Cache::get('articlesrelate-'.$id);
                }else{
                $articlesrelate = Article::join('authors as au','au.author_id','=','article.author_id')->where([['category_name',$section],['article_id','!=',$id],['category_name','!=',null]])->orderby('article_id','desc')->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(10)->get();

select * from `authors` where `valid` = 1 order by `author_id` asc limit 10 offset 0
select count(*) as aggregate from `authors` where `valid` = 1
---
    public function Authorrepo_listing_page(Request $request)
    {
        $page = explode('/', $request->path());
        $no = end($page);
        $ArrAuthorListing = DB::table('authors')->where('valid', '=', 1)->orderby('author_id','asc')->paginate(10);

select * from `articles` where `slug` = 'serviceworker.js' limit 1
---
    public function oldStoryRedirect($title)
    {
        $url = Articles::where('slug',$title)->firstOrFail();